import React, { Component } from 'react';
import { View, Text } from 'react-native';

export const xy2 = () => (
  <View style={{ display: 'flex', flexDirection: 'column', padding: 10 }}>
    <Text style={{ fontSize: 20, fontWeight: '600', color: '#333', textAlign: 'center' }}>
      {'F3监控APP隐私保护指引'}
    </Text>
    <Text>
      {'更新日期：2020年 10月 10日'}
    </Text>
    <Text>
      {'生效日期：2020年 10月 10日'}
    </Text>
    <Text>
      {'        F3监控APP（以下简称“F3监控”）是一款由北京中位科技有限公司（以下简称“我们”）研发和运营的移动产品，F3监控是基于中位物联网监管平台的移动监控解决方案，该APP结合了平台和市场需求，是一款为企业用户量身定制的超级移动物联网监控应用，具有独立发布部署和设置指定平台IP功能，让用户根据真自身情况进行快速部署。我们将通过《F3监控APP隐私保护指引》帮助您了解以下内容：'}
    </Text>
    <Text>
      {'        一.我们如何收集和使用您的信息'}
    </Text>
    <Text>
      {'        二.我们如何使用 Cookie 和同类技术'}
    </Text>
    <Text>
      {'        三.我们如何共享、转让、公开披露您的信息'}
    </Text>
    <Text>
      {'        四.我们如何保护您的信息'}
    </Text>
    <Text>
      {'        五.本政策如何更新'}
    </Text>
    <Text>
      {'        六.如何联系我们'}
    </Text>
    <Text style={{ fontWeight: '600', color: '#333' }}>
      {'        我们深知个人信息对您的重要性，并会尽全力保护您的个人信息安全可靠。请在使用我们的产品（或服务）前，仔细阅读并了解本《F3监控APP隐私保护指引》。'}
    </Text>
    <Text style={{ fontSize: 16, fontWeight: '600', color: '#333' }}>
      {'        一、我们如何收集和使用您的信息'}
    </Text>
    <Text>
      {'        （一）、我们如何收集信息'}
    </Text>
    <Text>
      {'        在您使用F3监控服务的过程中，F3监控会按照如下方式收集您在使用服务时主动提供或因为使用服务而产生的信息，用以向您提供服务、优化我们的服务以及保障您的帐号安全：'}
    </Text>
    <Text>
      {'        个人信息是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。我们将逐一说明我们收集的您的个人信息类型及其对应的用途，以便您了解我们针对某一特定功能所收集的具体个人信息的类别、使用理由及收集方式。'}
    </Text>
    <Text>
      {'        当您使用一些功能时，我们会在获得您的同意后，收集您的一些敏感信息，例如您在使用F3监控定位当前位置会收集您的地理位置信息，您在使用OCR功能时会获取您的相册和相机权限。除非按照相关法律法规要求必须收集，拒绝提供这些信息仅会使您无法使用相关特定功能，但不影响您正常使用F3监控的其他功能。'}
    </Text>
    <Text>
      {'        在您使用F3监控服务的过程中，F3监控仅会出于本隐私保护指引所述的如下目的、方式，收集您在使用服务时主动提供或因为使用服务而产生的信息，用以向您提供服务、优化我们的服务以及保障您的帐号安全：'}
    </Text>
    <Text style={{ fontWeight: '600', color: '#333' }}>
      {'        1.为您提供安全保障'}
    </Text>
    <Text>
      {'        当您使用F3监控服务时，为保障您正常使用我们的服务，维护我们服务的正常运行，改进及优化我们的服务体验以及保障您的帐号安全，我们会收集您的设备型号、操作系统、唯一设备标识符、登陆IP地址、F3监控软件版本号、接入网络的方式、类型和状态、网络质量数据、操作日志、服务日志信息（如您在阅读功能下的浏览历史、服务故障信息等信息）等日志信息，这类信息是为提供服务必须收集的基础信息（用于识别账号异常状态、修复APP崩溃等）。'}
    </Text>
    <Text style={{ fontWeight: '600', color: '#333' }}>
      {'        2.为方便您使用图片、拍照等功能'}
    </Text>
    <Text style={{ fontWeight: '600', color: '#333' }}>
      {'        当您使用F3监控拍摄或编辑图片时，为了向您提供该服务，我们会在获得您的明示同意后，访问您的相册、照相功能。上述信息属于敏感信息，拒绝提供该信息不影响您正常使用F3监控的其他功能。'}
    </Text>
    <Text style={{ fontWeight: '600', color: '#333' }}>
      {'        3.为方便您使用F3监控定位当前地理位置'}
    </Text>
    <Text style={{ fontWeight: '600', color: '#333' }}>
      {'        当您使用F3监控定位当前地理位置功能时，我们会在获得您的明示同意后，获取您的地理位置信息，并进行定位服务。上述信息属于敏感信息，拒绝提供这些信息仅会使您无法使用F3监控运动功能，但不影响您正常使用F3监控的其他功能。'}
    </Text>
    <Text style={{ fontWeight: '600', color: '#333' }}>
      {'        4.为方便您使用F3监控服务中的第三方服务功能'}
    </Text>
    <Text style={{ fontWeight: '600', color: '#333' }}>
      {'        F3监控服务中的第三方服务由外部第三方主体提供，F3监控无法获得您在使用该类第三方服务时产生的信息。但是，如果您已明示同意该第三方获得您向我们提供的个人信息，该第三方将通过F3监控接口获得上述信息。该地理位置信息属于敏感信息，拒绝提供该信息仅会使您无法使用上述第三方服务，但不影响您正常使用F3监控的功能。'}
    </Text>
    <Text>
      {'        我们会遵循法律规定对您的信息承担保密义务。 除以下情形外，我们不会对外共享您的个人信息：'}
    </Text>
    <Text>
      {'        我们的平台中可能会包含第三方SDK或其他嵌入的页面、应用程序等链接，如您在我们平台上使用这类由第三方提供的服务时，您同意将由其直接收集和处理您的信息（如以嵌入代码、插件等形式）。 第三方收集和处理信息等行为遵守其自身的隐私条款。为了最大程度保障您的信息安全，我们会对嵌入的第三方SDK、链接等服务的隐私协议进行查验，同时建议您在使用任何第三方SDK、链接等服务前先行查看其隐私条款。 为保障您的合法权益，在您发现第三方SDK、链接等服务存在风险时，建议您立即终止相关操作并及时向我们反馈，反馈方式见本政策第七章节；'}
    </Text>
    <Text>
      {'        （I）为了分享app目的，我们使用了友盟+SDK分享功能，需要收集您设备的国际移动设备识别码（IMEI）、iOS广告标识符（IDFA)、设备Mac地址和设备型号等信息。 为便于您更好地了解友盟+SDK采集的数据类型及用途，以及何保护您的个人信息，您可以访问：https://www.umeng.com/policy，了解友盟+隐私权政策。'}
    </Text>
    <Text>
      {'        （II）为了给您提供OCR识别图片功能，我们使用了百度可能会需要收集您设备的国际移动设备识别码等信息，以保证数据统计的准确性。为便于您更好地了解百度服务，以及保护您的个人信息，您可以访问：https://cloud.baidu.com/doc/Agreements/s/Kjwvy245m，了解百度OCR隐私权政策。'}
    </Text>
    <Text>
      {'        （III）为了给您提供更好的定位服务体验，我们使用了百度地图需要收集您设备的国际移动设备识别码（IMEI）、iOS广告标识符（IDFA)、设备Mac地址和设备型号等信息。为便于您更好地了解百度地图采集的数据类型及用途，以及何保护您的个人信息，您可以访问：https://lbsyun.baidu.com/index.php?title=open/privacy，了解百度地图隐私权政策。'}
    </Text>
    <Text style={{ fontWeight: '600', color: '#333' }}>
      {'        5.其他情况'}
    </Text>
    <Text>
      {'        根据相关法律法规及国家标准，以下情形中，我们可能会收集、使用您的相关个人信息无需征求您的授权同意：'}
    </Text>
    <Text>
      {'        1) 与国家安全、国防安全等国家利益直接相关的；与公共安全、公共卫生、公众知情等重大公共利益直接相关的；'}
    </Text>
    <Text>
      {'        2) 与犯罪侦查、起诉、审判和判决执行等直接相关的；'}
    </Text>
    <Text>
      {'        3) 出于维护您或其他个人的生命、财产、声誉等重大合法权益但又很难得到本人同意的；'}
    </Text>
    <Text>
      {'        4) 所收集的个人信息是您自行向社会公众公开的；'}
    </Text>
    <Text>
      {'        5) 从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；'}
    </Text>
    <Text>  
      {'        6) 根据您要求签订和履行合同所必需的；'}
    </Text>
    <Text>
      {'        7) 用于维护所提供的产品或服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障；'}
    </Text>
    <Text>  
      {'        8) 为开展合法的新闻报道所必需的；'}
    </Text>
    <Text>
      {'        9) 出于公共利益开展统计或学术研究所必要，且其对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；'}
    </Text>
    <Text>
      {'        10) 法律法规规定的其他情形。'}
    </Text>
    <Text>
      {'        请您理解，我们向您提供的功能和服务是不断更新和发展的，如果某一功能或服务未在前述说明中且收集了您的信息，我们会通过页面提示、交互流程、网站公告等方式另行向您说明信息收集的内容、范围和目的，以征得您的同意。'}
    </Text>
    <Text style={{ fontWeight: '600', color: '#333' }}>
      {'        目前，除因使用F3监控账号登录第三方APP而获取相关日志信息外，F3监控不会主动从我们之外的第三方获取您的个人信息。如未来为业务发展需要从其他第三方间接获取您的个人信息，我们会在获取前向您明示您个人信息的来源、类型及使用范围，如F3监控开展业务需进行的个人信息处理活动超出您原本向第三方提供个人信息时的授权同意范围，我们将在处理您的该等个人信息前，征得您的明示同意；此外，我们也将会严格遵守相关法律法规的规定，并要求第三方保障其提供的信息的合法性。'}
    </Text>
    <Text>
      {'        （一）、我们如何使用信息'}
    </Text>
    <Text>
      {'        我们严格遵守法律法规的规定以及与用户的约定，按照本隐私保护指引所述使用收集的信息，以向您提供更为优质的服务。'}
    </Text>
    <Text style={{ fontWeight: '600', color: '#333' }}>
      {'        1.信息使用规则'}
    </Text>
    <Text style={{ fontWeight: '600', color: '#333' }}>
      {'        1) 我们会根据已收集的信息向您提供各项功能与服务，包括加好友、发消息、F3监控运动、微社区等功能；'}
    </Text>
    <Text style={{ fontWeight: '600', color: '#333' }}>
      {'        2) 我们会使用cookie及相关技术收集您的账号号码、阅读记录、观看历史、位置信息等特征为您提供个性化服务，包括基于对应账号号码的特征标签进行间接人群画像并向您提供更加精准和个性化的服务和内容等，并评估、改善我们个性化服务的效果；'}
    </Text>
    <Text style={{ fontWeight: '600', color: '#333' }}>
      {'        3) 我们会根据您使用F3监控的频率、故障信息、性能信息等分析我们产品的运行情况，以确保服务的安全性并优化我们的产品，提高我们的服务质量。我们不会将我们存储在分析软件中的信息与您提供的个人身份信息相结合。'}
    </Text>
    <Text>
      {'        2.告知变动目的后征得同意的方式'}
    </Text>
    <Text>
      {'        我们将会在本隐私保护指引所涵盖的用途内使用收集的信息。如我们使用您的个人信息，超出了与收集时所声称的目的及具有直接或合理关联的范围，我们将在使用您的个人信息前，再次向您告知并征得您的明示同意。'}
    </Text>
    <Text style={{ fontSize: 16, fontWeight: '600', color: '#333' }}>
      {'        二、我们如何使用 Cookie 和同类技术'}
    </Text>
    <Text>
      {'        为确保网站正常运转、为您获得更轻松的访问体验、向您推荐您可能感兴趣的内容，我们会在您的计算机或移动设备上存储Cookie、Flash Cookie，或浏览器（或关联应用程序）提供的其他通常包含标识符、站点名称以及一些号码和字符的本地存储（统称“Cookie”）。借助于 Cookie，网站能够存储您的偏好等数据。'}
    </Text>
    <Text>
      {'        如果您的浏览器或浏览器附加服务允许，您可修改对Cookie的接受程度或拒绝我们的Cookie。有关详情，请参见 AboutCookies.org。但如果您这么做，在某些情况下可能会影响您安全访问我们的网站，且可能需要在每一次访问我们的网站时更改用户设置。'}
    </Text>
    <Text style={{ fontSize: 16, fontWeight: '600', color: '#333' }}>
      {'        三、我们如何共享、转让、公开披露您的信息'}
    </Text>
    <Text>
      {'        请您注意，目前，F3监控不会主动共享或转让您的个人信息至我们之外的第三方，如存在其他共享或转让您的个人信息或您需要我们将您的个人信息共享或转让至我们之外的第三方情形时，我们会直接或确认第三方征得您对上述行为的明示同意，此外，我们会对对外提供信息的行为进行风险评估。'}
    </Text>
    <Text>
      {'        我们不会对外公开披露其收集的个人信息，如必须公开披露时，我们会向您告知此次公开披露的目的、披露信息的类型及可能涉及的敏感信息，并征得您的明示同意。'}
    </Text>
    <Text>
      {'        随着我们业务的持续发展，我们有可能进行合并、收购、资产转让等交易，我们将告知您相关情形，按照法律法规及不低于本指引所要求的标准继续保护或要求新的控制者继续保护您的个人信息。'}
    </Text>
    <Text>
      {'        另外，根据相关法律法规及国家标准，以下情形中，我们可能会共享、转让、公开披露个人信息无需事先征得个人信息主体的授权同意：'}
    </Text>
    <Text>
      {'        1) 与国家安全、国防安全直接相关的；'}
    </Text>
    <Text>
      {'        2) 与公共安全、公共卫生、重大公共利益直接相关的；'}
    </Text>
    <Text>
      {'        3) 与犯罪侦查、起诉、审判和判决执行等直接相关的；'}
    </Text>
    <Text>
      {'        4) 出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；'}
    </Text>
    <Text>
      {'        5) 个人信息主体自行向社会公众公开的个人信息；'}
    </Text>
    <Text>
      {'        6) 从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。'}
    </Text>
    <Text>
      {'        7) 在法律、法律程序、诉讼或政府主管部门强制性要求的情况下。'}
    </Text>
    <Text style={{ fontSize: 16, fontWeight: '600', color: '#333' }}>
      {'        四、我们如何保护您的信息'}
    </Text>
    <Text>
      {'        （一）、信息的存储'}
    </Text>
    <Text>
      {'        1. 信息存储的地点'}
    </Text>
    <Text>
      {'        我们会按照法律法规规定，将境内收集的用户个人信息存储于中国境内。目前我们不会跨境传输或存储您的个人信息。将来如需跨境传输或存储的，我们会向您告知信息出境的目的、接收方、安全保证措施和安全风险，并征得您的同意。'}
    </Text>
    <Text>
      {'        2. 信息存储的方式和期限'}
    </Text>
    <Text>
      {'        2) 图片或视频：当您使用F3监控微社区等功能发布了图片、视频，我们需要保存您上述信息及相关评论，以保证您正常使用；当您主动删除上述信息后，我们将删除相应的信息。'}
    </Text>
    <Text>
      {'        3) 当我们的产品或服务发生停止运营的情形时，我们将以推送通知、公告等形式通知您，并在合理的期限内删除您的个人信息。'}
    </Text>
    <Text>
      {'        （二）、信息的安全'}
    </Text>
    <Text>
      {'        1.安全保护措施'}
    </Text>
    <Text style={{ fontWeight: '600', color: '#333' }}>
      {'        我们努力为用户的信息安全提供保障，以防止信息的泄露、丢失、不当使用、未经授权访问和披露等。我们使用多方位的安全保护措施，以确保用户的个人信息保护处于合理的安全水平，包括技术保护手段、管理制度控制、安全体系保障等诸多方面。此外，我们还通过了国家网络安全等级保护（三级）的测评和备案。'}
    </Text>
    <Text style={{ fontWeight: '600', color: '#333' }}>
      {'        我们采用业界领先的技术保护措施。我们使用的技术手段包括但不限于防火墙、加密（例如SSL）、去标识化或匿名化处理、访问控制措施等。此外，我们还会不断加强安装在您设备端的软件的安全能力。例如，我们会在您的设备本地完成部分信息加密工作，以巩固安全传输；我们会了解您设备安装的应用信息和运行的进程信息，以预防病毒、木马等恶意程序。'}
    </Text>
    <Text style={{ fontWeight: '600', color: '#333' }}>
      {'        我们建立了保障个人信息安全专门的管理制度、流程和组织。例如，我们严格限制访问信息的人员范围，要求他们遵守保密义务并进行审计，违反义务的人员会根据规定进行处罚。我们也会审查该管理制度、流程和组织，以防未经授权的人员擅自访问、使用或披露用户的信息。'}
    </Text>
    <Text>
      {'        2. 安全事件处置措施'}
    </Text>
    <Text>
      {'        若发生个人信息泄露、损毁、丢失等安全事件，我们会启动应急预案，阻止安全事件扩大。安全事件发生后，我们会及时以推送通知、邮件等形式告知您安全事件的基本情况、我们即将或已经采取的处置措施和补救措施，以及我们对您的应对建议。如果难以实现逐一告知，我们将通过公告等方式发布警示。'}
    </Text>
    <Text style={{ fontSize: 16, fontWeight: '600', color: '#333' }}>
      {'        五、本政策如何更新'}
    </Text>
    <Text>
      {'        我们可能会适时对本指引进行修订。当指引的条款发生变更时，我们会在您登录及版本更新时以不限于网站公示、推送通知、弹窗等形式向您展示变更后的指引。请您注意，只有在您勾选同意按钮后，我们才会按照更新后的指引收集、使用、存储您的个人信息。'}
    </Text>
    <Text style={{ fontSize: 16, fontWeight: '600', color: '#333' }}>
      {'        六、如何联系我们'}
    </Text>
    <Text>
      {'        如果您对本隐私保护指引有任何疑问、意见或建议，或有其他投诉、举报、信息授权及使用的相关问题，请通过F3监控客服与我们联系。我们将尽快审核所涉问题，一般情况下，我们将在验证您的用户身份后的15日内处理并向您回复。'}
    </Text>
    <Text style={{ textAlign: 'right', fontSize: 16, fontWeight: '600' }}>
      {'北京中位科技有限公司'}
    </Text>
  </View>
);
